Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/insurance/unclaimed_life_insurance_policies.html.txt.tmx
Source language: en
Languages: ga

source: Unclaimed life insurance policies
ga: Polasaithe árachais saoil nár héilíodh

source: The Unclaimed Life Assurance Policies Act 2003 requires insurance companies to identify and contact the owners of unclaimed life insurance policies
ga: Faoin Acht um Pholasaithe Árachais Saoil nár hÉilíodh 2003, ní mór do chomhlachtaí árachais úinéirí na bpolasaithe árachais saoil nár héilíodh a aimsiú agus teagmháil a dhéanamh leo

source: If the owners cannot be traced, the proceeds of the policies will be transferred to the Dormant Accounts Fund, which is managed by the National Treasury Management Agency
ga: Muna féidir teacht ar na húinéirí ní mór ansin luach na bpolasaithe a aistriú isteach i gCiste na gCuntas Díomhaoin, atá dhá bhainistiú ag an Údarás Náisiúnta um Bhainistiú Ciste an Stáit

source: The contents of the Dormant Accounts Fund are invested and the surplus disbursed by the Dormant Accounts Disbursement Fund to be used on programmes or projects to help people with disabilities and people who are economically, socially or educationally disadvantaged
ga: Déantar a bhfuil i gCiste na gCuntas Díomhaoin a infheistiú agus caitheann Ciste Íocaíochta na gCuntas Díomhaoin an fuílleach ar chláracha nó tograí le cúnamh a thabhairt do dhaoine faoi mhíchumas agus do dhaoine atá faoi mhíbhuntáiste eacnamaíochta, sóisialta nó oideachais

source: When is a life insurance policy considered to be dormant?
ga: Cén uair a dheirtear go bhfuil polasaí árachais saoil díomhaoin?

source: The dormancy period depends on whether the life assurance policy has a specified term or not
ga: Braitheann fad na tréimhse díomhaoin ar téarma a bheith luaite leis an bpolasaí árachais saoil

source: If the policy has a specified term, it will be considered dormant if the customer has not been in contact with the insurance company for 5 years from the date the policy matured or the company's last communication with the customer, whichever is later
ga: Má tá téarma faoi leith luaite leis an bpolasaí deirtear go bhfuil sé díomhaoin muna raibh an custaiméir i dteagmháil leis an gcomhlacht árachais le cúig bliain ón dáta gur tháinig an polasaí in aois nó ón dáta deireanach a raibh cumarsáid ag an gcomhlacht leis an gcustaiméir, cibé acu is deireanaí

source: If the policy does not have a specified term, it will be considered to be dormant if there has been no communication between the company and the customer for 15 years
ga: Muna bhfuil téarma faoi leith luaite leis an bpolasaí deirtear go bhfuil sé díomhaoin muna raibh aon chumarsáid idir an comhlacht agus an custaiméir le cúig bliain déag

source: Dormant life assurance policies must be transferred to the Dormant Accounts Fund in April of each year
ga: Ní mór polasaithe árachais saoil a aistriú chuig Ciste na gCuntas Díomhaoin i mí an Aibreáin gach bliain

source: You have the right to claim the funds contained in your dormant life assurance policy at any time
ga: Tá sé de cheart agat an t-airgead atá i do pholasaí díomhaoin árachais saoil a éileamh ag am ar bith

source: There is no time-bar on account holders or their next of kin reclaiming dormant funds, as their rights are preserved
ga: Níl aon teorainn ama do shealbhóirí cuntais ná a ngarghaolta cistí díomhaoine a éileamh, mar tá a gcuid cearta cosanta

source: This means that even if the funds have been transferred to the Dormant Accounts Fund, you or your next of kin still have a claim on your funds
ga: Mar sin fiú má bhíonn an t-airgead nó maoin aistrithe isteach i gCiste na gCuntas Díomhaoin is féidir leatsa nó le do gharghaolta éileamh a dhéanamh ar an airgead nó ar an maoin

source: What life insurance policies are covered?
ga: Cé na polasaithe árachais saoil atá clúdaithe?

source: The Unclaimed Life Assurance Act applies to all insurance undertakings in Ireland and all life assurance policies that have been taken out by Irish residents, with the exception of policies that form part of the assets of occupational pension schemes, group health insurance or disability benefit schemes and sponsored superannuation schemes
ga: Baineann an tAcht um Pholasaithe Árachais Saoil nár hÉilíodh le gach gealltanas árachais in Éirinn agus le gach polasaí árachais saoil a thóg saoránaigh Éireannacha, ach amháin polasaithe gur cuid de mhaoin scéimeanna pinsin saothair iad, árachas sláinte grúpaí nó scéimeanna um shochar míchumais agus scéimeanna pinsin le tacaíocht

source: What do insurance companies have to do under the terms of the Unclaimed Life Assurance Act?
ga: Céard atá le déanamh ag comhlachtaí árachais faoi théarmaí an Achta um Pholasaithe Árachais Saoil nár hÉilíodh?

source: Insurance companies must personally contact customers whose life insurance policies are worth €500 or more and tell them how to claim the proceeds of the policies
ga: Ní mór do chomhlachtaí árachais dul i dteagmháil go pearsanta le custaiméirí gur fiú €500 nó níos mó a bpolasaithe árachais agus insint dóibh conas fáltas na bpolasaithe a éileamh

source: Companies must also place advertisements in the national press twice yearly to inform customers whose policies are worth less than €500
ga: Ní mór do chomhlachtaí freisin fógraí a chur i nuachtáin náisiúnta faoi dhó sa bhliain le custaiméirí gur fiú níos lú ná €500 a bpolasaithe a chur ar an eolas

source: Insurance companies must keep a register of unclaimed policies
ga: Ní mór do chomhlachtaí árachais clár a choinneáil de na polasaithe nár héilíodh

source: The insurance companies must calculate the cash value of unclaimed life insurance policies on the date that they are transferred to the Dormant Accounts Fund
ga: Ní mór do na comhlachtaí árachais luach airgid aon pholasaithe árachais saoil nár héilíodh a ríomh ar an dáta ar déanadh iad a aistriú isteach i gCiste na gCuntas Díomhaoin

source: Companies must only transfer the investment value of the policy and must retain the insurance element
ga: Ní mór do chomhlachtaí luach infheistíochta an pholasaí amháin a aistriú agus an chuid árachais a choinneáil

source: Contact your life insurance company
ga: Déan teagmháil le do chomhlacht árachais saoil

source: The Irish Insurance Federation maintains a list of insurance providers
ga: Tá liosta soláthróirí árachais cothabháilte ag an Cónaidhm Árachais na hÉireann
